База данных для интернет-магазина продающего модную одежду по России и за границу.

Содержит данные о товаре, его запасах на складе, стоимости, распродажах и новых коллекциях.
Возможные таблицы:
- Products
- Storage


Содержит такие данные о зарегистрированных посетителях сайта, как имя и фамилия, почта и адрес доставки.
Возможные таблицы:
- Users

Содержит данные о способах доставки и платежных системах. Возможные таблицы:
- Delivery
- Payment
- Orders
- Discounts

Содержит медиаконтент, фото и видеоролики. Возможные таблицы:
- Media
- Communication (blog)

Содержит корзину покупок объединяющую базу продуктов и пользователей.
То есть в моем магазине все крутится вокруг корзины покупок, все ведет к ней. Мне кажется это логично.